case/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2512                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0]; // Or usually [1 -1 -1 0 0 0 0] in some solvers, wait, kinematic alphat is [0 2 -1 0 0 0 0]. Boussinesq is kinematic.

internalField   uniform 0;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           uniform 0;
    }
    coldWall
    {
        type            calculated;
        value           uniform 0;
    }
    adiabaticWalls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
